#### Import արեք pandas գրադարանը pd  անունով

In [31]:
import pandas as pd

### Import the dataset baby_names.txt, assign it to a variable called baby_names

### Import արեք baby_names.txt dataset-ը ու այն վերագրեք baby_names փոփոխականի

In [36]:
baby_names = pd.read_csv('baby_names.csv')

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [37]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [38]:
baby_names = baby_names.drop(['Unnamed: 0', 'Id'],axis = 1)

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [39]:
baby_names['Gender'].value_counts()
##Females :)

F    2404
M      99
Name: Gender, dtype: int64

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [40]:
baby_names = baby_names.drop('Year',axis = 1)
baby_names.sort_values('Name')

         Name Gender State  Count
1553  Aaliyah      F    AK     12
684   Aaliyah      F    AK     14
560   Aaliyah      F    AK      6
1374  Aaliyah      F    AK      8
907   Aaliyah      F    AK     10
...       ...    ...   ...    ...
343      Zoey      F    AK      7
2193     Zoey      F    AK     22
1507     Zoey      F    AK     30
1990     Zoey      F    AK     15
165      Zoey      F    AK      6

[2503 rows x 4 columns]

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [41]:
baby_names['Name'].nunique()

575

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [45]:
baby_names['Name'].mode()

0    Riley
dtype: object

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [47]:
#### ???? Median of string

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [49]:
baby_names.describe()

## only for numerical column.

             Count
count  2503.000000
mean     11.485018
std       8.830294
min       5.000000
25%       6.000000
50%       8.000000
75%      13.000000
max      65.000000